app/views/fathers/show.html.erb

SELECT "children".* FROM "children" WHERE "children"."father_id" = 1
---
  <ul>
    <% @father.children.each do |child| %>