app/controllers/children_controller.rb

    def set_fathers
      @fathers = Father.all
---
SELECT "fathers".* FROM "fathers"