app/controllers/fathers_controller.rb

SELECT "fathers".* FROM "fathers"
---
  def index
    @fathers = Father.all

INSERT INTO "fathers" ("name", "created_at", "updated_at", "cpf", "email", "occupation_id") VALUES (NULL, '2025-08-27 23:20:33.058777', '2025-08-27 23:20:33.058777', NULL, NULL, 2) RETURNING "id"
---
  def create
    @father = Father.new(father_params)

    respond_to do |format|
      if @father.save

UPDATE "fathers" SET "updated_at" = '2025-09-11 23:07:36.855608' WHERE "fathers"."id" = 5
---
  def update
    respond_to do |format|
      if @father.update(father_params)

SELECT "fathers".* FROM "fathers" WHERE "fathers"."id" = 1 LIMIT 1
---
    def set_father
      @father = Father.find(params.expect(:id))

SELECT "occupations".* FROM "occupations"
---
    def set_occupations
      @occupations = Occupation.all