app/controllers/occupations_controller.rb

SELECT "occupations".* FROM "occupations"
---
  def index
    @occupations = Occupation.all

INSERT INTO "occupations" ("description", "created_at", "updated_at") VALUES ('railson', '2025-09-18 23:27:44.762485', '2025-09-18 23:27:44.762485') RETURNING "id"
---
  def create
    @occupation = Occupation.new(occupation_params)

    respond_to do |format|
      if @occupation.save

SELECT "occupations".* FROM "occupations" WHERE "occupations"."id" = 1 LIMIT 1
---
    def set_occupation
      @occupation = Occupation.find(params.expect(:id))

SELECT "occupations".* FROM "occupations"
---
    def set_occupations
      @occupations = Occupation.all